export const ru = {
  header: {
    home: 'Главная',
    games: 'Игры и Инструменты',
    privacy: 'Конфиденциальность',
    term: 'Условия использования',
    blog: 'Блог',
    official: 'Официальный сайт',
  },
  footer: {
    product: {
      title: 'Продукт',
      features: 'Функции',
      security: 'Безопасность',
      team: 'Команда',
      enterprise: 'Предприятие',
      customerStories: 'Истории клиентов',
      pricing: 'Цены',
      resources: 'Ресурсы',
    },
    platform: {
      title: 'Платформа',
      developerAPIs: 'API для разработчиков',
      partners: 'Партнеры',
      atom: 'Atom',
      electron: 'Electron',
      astrowindDesktop: 'AstroWind для ПК',
    },
    support: {
      title: 'Поддержка',
      docs: 'Документация',
      communityForum: 'Форум сообщества',
      professionalServices: 'Профессиональные услуги',
      skills: 'Навыки',
      status: 'Статус',
    },
    company: {
      title: 'Компания',
      about: 'О нас',
      blog: 'Блог',
      careers: 'Карьера',
      press: 'Пресса',
      inclusion: 'Инклюзивность',
      socialImpact: 'Социальное влияние',
      shop: 'Магазин',
    },
    legal: {
      terms: 'Условия',
      privacy: 'Конфиденциальность',
    },
  },
  index: {
    metadata: {
      title: 'Switch2 игры, новости, руководства и многое другое',
    },
    hero: {
      tagline: 'Новости Switch2',
      cta2: 'Смотреть сейчас',
      imageAlt: 'Главное изображение Switch2',
      title: {
        part1: 'Nintendo Switch 2 скоро появится!',
      },
      subtitle: 'С элегантным дизайном, большим и более четким экраном, а также более удобным подключением Joy-Con. Производительность значительно улучшена с обратной совместимостью, позволяющей плавно играть в старые игры. С уникальными функциями и оптимизированным дизайном, обеспечивающим игрокам более захватывающий и комфортный игровой опыт. Идеальный выбор для любителей игр.',
    },
    steps: {
      title: 'Важные события Switch2',
      items1: {
        title: 'Выпуск трейлера <br /> <span class="text-sm font-normal">16 января 2025</span>',
        description: 'Вечером 16 января Nintendo официально выпустила тизер Switch 2 продолжительностью всего 2 минуты 21 секунду. Также было объявлено, что 2 апреля состоится специальная личная встреча, где будут раскрыты подробные характеристики оборудования, цена и другая информация о Switch 2.',
        icon: 'tabler:briefcase',
      },
      items2: {
        title: 'Личная встреча<br /> <span class="text-sm font-normal">2 апреля 2025</span>',
        description: 'Скоро..',
        icon: 'tabler:briefcase',
      },
      items3: {
        title: 'Дата выхода Switch2<br /> <span class="text-sm font-normal">? ? 2025</span>',
        description: 'Ожидание официального объявления..',
        icon: 'tabler:briefcase',
      },
    },
    features: {
      tagline: 'Характеристики',
      title: 'Технические характеристики Switch2',
      subtitle: 'Неофициальная утечка информации о Switch2',
      items1: {
        title: 'Экран',
        description: '8-дюймовый экран, возможно с технологией IPS-LCD.',
      },
      items2: {
        title: 'Контроллеры',
        description: 'Увеличенные Joy-Con с магнитным креплением, дополнительный порт Type-C сверху, квадратная кнопка скриншота на левом Joy-Con, сохранена кнопка Home и добавлена новая кнопка на правом Joy-Con, вероятно с джойстиками на эффекте Холла для предотвращения дрейфа, возможна поддержка режима мыши.',
      },
      items3: {
        title: 'Корпус',
        description: 'Легкий и портативный корпус с матовой отделкой, комфортный и устойчивый к отпечаткам пальцев, регулируемая подставка с большим углом наклона для удобного позиционирования в настольном режиме.',
      },
      items4: {
        title: 'Процессор',
        description: 'Возможно использование специального чипа NVIDIA T239 с процессором Arm Cortex-A78AE на 8 или 12 ядер и GPU на архитектуре Ampere, поддерживающим трассировку лучей, DLSS 3 и кодек AV1. Ожидаемая графическая производительность сравнима с мобильной версией RTX 3050 4GB.',
      },
      items5: {
        title: 'Память',
        description: 'Возможно 12 ГБ оперативной памяти, значительное улучшение многозадачности и игровой производительности.',
      },
      items6: {
        title: 'Порты',
        description: 'По одному порту USB Type-C сверху и снизу для удобной зарядки и подключения внешних устройств.',
      },
    },
    fragment: {
      h2: 'Линейка игр',
      p1: "Switch2 обеспечит лучший игровой опыт и более мощную производительность, предоставляя игрокам беспрецедентные впечатления от игр.",
      p2: 'Ожидаемая линейка игр для Switch2 включает различные жанры, такие как экшен, приключения, гонки и ролевые игры, удовлетворяя потребности разных игроков. Классические IP Nintendo, такие как Mario Kart 9, новая 3D игра Mario (возможно, Mario: Odyssey 2), Metroid Prime 4 и улучшенная версия Zelda (вероятно, Breath of the Wild) привлекают большое внимание. Final Fantasy 7: Remake, Assassin\'s Creed: Fantasy, The Division, Rainbow Six и другие известные разработчики игр также выпустят свои игры на Switch2, предоставляя игрокам более богатый игровой опыт.',
    },
    testimonials: {
      title: 'Обзоры игр',
      subtitle: 'Узнайте, что говорят игроки о популярных играх Switch',
      item1: {
        testimonial: 'The Legend of Zelda: Tears of the Kingdom - это шедевр! Обширный открытый мир и креативные механики строительства предоставляют бесконечные возможности. Внимание к деталям и удовольствие от свободного исследования делают каждый момент захватывающим.',
        job: 'Любитель приключенческих игр',
      },
      item2: {
        testimonial: 'Super Mario Wonder привносит инновационные функции, сохраняя классическую магию Марио. Эффекты Wonder удивительным образом меняют уровни, а многопользовательский режим невероятно весел с друзьями и семьей.',
        job: 'Игрок в платформеры',
      },
      item3: {
        testimonial: 'Дизайн открытого мира Pokémon Scarlet/Violet революционен для серии. Свобода исследования и ловли покемонов в по-настоящему открытой среде впечатляет. Новый феномен Терастал добавляет захватывающие изменения в боях.',
        job: 'Тренер покемонов',
      },
    },
  },
};
